#  Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. 
# Петя помогает Кате по математике. 
# Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. 
# Для этого Петя делает две подсказки. 
# Он называет сумму этих чисел S и их произведение P. 
# Помогите Кате отгадать задуманные Петей числа.


s = int(input('Введите сумму чисел X и Y: '))
p = int(input('Введите произведение чисел X и Y: '))
for x in range(s):
    for y in range(s):
        if x + y == s:
            break
    if x * y == p:
        print(f'Петя загадал числа {x} и {y}')
        break
